#### TextElementBackground Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing all the background mode for the built-in parameter TEXT\_BACKGROUND.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum TextElementBackground ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration TextElementBackground ``` |

| Visual C++ |
| --- |
| ``` public enum class TextElementBackground ``` |

# Members

| Member name | Description |
| --- | --- |
| TBGR\_OPAQUE | The TextElement object is opaque. |
| TBGR\_TRANSPARENT | The TextElement object is transparent. |

# See Also

Autodesk.Revit.DB Namespace